Arellano1904/Texas-Instruments-TivaC/TM4C123GH6PM_develop/drivers/2.4inchDisplay.c
static void delay_ms(uint32_t ms){
    while(ms--)
        delay_us(1000U);
}

//*****************************************************************************
// //***** Display (ILI9341) functions *****//
//*****************************************************************************
void display_enable(void){
    // CS to low (Enable the Display) //
    MAP_GPIOPinWrite(GPIO_PORTD_BASE, GPIO_PIN_1, 0);
}
void display_disable(void){
    // CS high to disabble the display //
    MAP_GPIOPinWrite(GPIO_PORTD_BASE,GPIO_PIN_1, GPIO_PIN_1);
}
void display_cmd_mode(void){
    // DC to low put the Display  in command mode //
    MAP_GPIOPinWrite(GPIO_PORTD_BASE, GPIO_PIN_2, 0);
}
void display_data_mode(void){
    // DC high to put the Display in data mode //
    MAP_GPIOPinWrite(GPIO_PORTD_BASE, GPIO_PIN_2, GPIO_PIN_2);
}

void display_rst(void){
    // RESET pin low: assert reset (datasheet min pulse 10 us; 20 ms is generous).
    MAP_GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_5, 0);
    delay_ms(20);
    // RESET pin high: release reset, then wait for the controller to come up.
    MAP_GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_5, GPIO_PIN_5);
    delay_ms(120);
}

void display_snd_cmd(uint8_t cmd){
    display_enable();
    display_cmd_mode();
    // Send the command through SSI3
    MAP_SSIDataPut(SSI3_BASE, cmd);
    // Wait for data to be transferred
    while(MAP_SSIBusy(SSI3_BASE));
    display_disable();
}

void display_snd_data(uint8_t data){
    display_enable();
    display_data_mode();
    // Send the data to SSI3
    MAP_SSIDataPut(SSI3_BASE, data);
    // Wait for data to be transferred
    while(MAP_SSIBusy(SSI3_BASE));
    display_disable();
}

//*****************************************************************************
// Power-on initialization sequence.
//
// Data-driven table: each row is { command, parameter count, parameters,
// post-command delay (ms) }. The power/VCOM/gamma registers are the
// manufacturer-recommended ILI9341 values; together with the 119 Hz frame
// rate (FRMCTR1) and the existing 30 MHz SPI + uDMA path they give the best
// image quality and the fastest refresh the panel supports.
//*****************************************************************************
typedef struct {
    uint8_t  cmd;
    uint8_t  numArgs;
    uint8_t  args[15];
    uint16_t delayMs;
} ILI9341_InitCmd;

static const ILI9341_InitCmd ili9341_init_seq[] = {
    { 0xCB, 5, { 0x39, 0x2C, 0x00, 0x34, 0x02 },          0 }, // Power control A
    { 0xCF, 3, { 0x00, 0xC1, 0x30 },                      0 }, // Power control B
    { 0xE8, 3, { 0x85, 0x00, 0x78 },                      0 }, // Driver timing control A
    { 0xEA, 2, { 0x00, 0x00 },                            0 }, // Driver timing control B
    { 0xED, 4, { 0x64, 0x03, 0x12, 0x81 },                0 }, // Power-on sequence control
    { 0xF7, 1, { 0x20 },                                  0 }, // Pump ratio control
    { 0xC0, 1, { 0x23 },                                  0 }, // Power control 1 (VRH)
    { 0xC1, 1, { 0x10 },                                  0 }, // Power control 2 (BT)
    { 0xC5, 2, { 0x3E, 0x28 },                            0 }, // VCOM control 1
    { 0xC7, 1, { 0x86 },                                  0 }, // VCOM control 2
    { ILI9341_COLMOD, 1, { 0x55 },                        0 }, // 16 bpp, RGB565
    { ILI9341_MADCTL, 1, { 0x20 },                        0 }, // RGB, 180 deg rotation
    { 0xB1, 2, { 0x00, 0x10 },                            0 }, // Frame rate ~119 Hz (max); use 0x18 (~79 Hz) if unstable
    { 0xB6, 3, { 0x08, 0x82, 0x27 },                      0 }, // Display function control (320 lines)
    { 0xF2, 1, { 0x00 },                                  0 }, // 3-gamma disable
    { 0x26, 1, { 0x01 },                                  0 }, // Gamma curve 1
    { 0xE0, 15, { 0x0F, 0x31, 0x2B, 0x0C, 0x0E, 0x08, 0x4E, 0xF1,
                  0x37, 0x07, 0x10, 0x03, 0x0E, 0x09, 0x00 }, 0 }, // Positive gamma
    { 0xE1, 15, { 0x00, 0x0E, 0x14, 0x03, 0x11, 0x07, 0x31, 0xC1,
                  0x48, 0x08, 0x0F, 0x0C, 0x31, 0x36, 0x0F }, 0 }, // Negative gamma
    { ILI9341_SLPOUT, 0, { 0 },                         120 }, // Sleep out, then supply/clock settle
    { ILI9341_DISPON, 0, { 0 },                          20 }, // Display on
};

void display_init(void){
    // Peripherals: SPI link, uDMA pixel pump, and the ADC/PWM backlight control.
    display_spi_config();
    display_dma_config();
    // display_adc_config();
    // display_pwm_config();

    // Hardware reset (reloads factory defaults; includes the required delays).
    display_rst();

    // Commands and their parameters are single bytes.
    display_spi_data_len(8);

    uint32_t i;
    uint8_t  a;
    for (i = 0; i < sizeof(ili9341_init_seq) / sizeof(ili9341_init_seq[0]); i++){
        const ILI9341_InitCmd *c = &ili9341_init_seq[i];
        display_snd_cmd(c->cmd);
        for (a = 0; a < c->numArgs; a++)
            display_snd_data(c->args[a]);
        if (c->delayMs)
            delay_ms(c->delayMs);
    }

    // Switch to 16-bit frames for fast pixel streaming via uDMA.
    display_spi_data_len(16);
}

void display_set_window(uint16_t x0, uint16_t y0,uint16_t x1, uint16_t y1){
    // Config spi3 to send command and data configuration
    display_spi_data_len(8);
    // Column Address Set (CASET)
    display_snd_cmd(ILI9341_CASET);
    display_snd_data(x0 >> 8);     // X start high
    display_snd_data(x0 & 0xFF);   // X start low
    display_snd_data(x1 >> 8);     // X end high
    display_snd_data(x1 & 0xFF);   // X end low

    // Page Address Set (PASET)
    display_snd_cmd(ILI9341_PASET);
    display_snd_data(y0 >> 8);     // Y start high
    display_snd_data(y0 & 0xFF);   // Y start low
    display_snd_data(y1 >> 8);     // Y end high
    display_snd_data(y1 & 0xFF);   // Y end low

    // Write to RAM
    display_snd_cmd(ILI9341_RAMWR);
    // Config spi3 to send pixels data
    display_spi_data_len(16);

}

void display_fill_screen(uint16_t color){
    uint16_t  i;
    // Fill a chunk color buffer
    for(i=0;i<ILI9341_WIDTH*ILI9341_LINES_PER_BUFFER;i++)
        colorBufer[i] = color;

    display_set_window(0, 0, ILI9341_WIDTH - 1, ILI9341_HEIGHT - 1);
    display_enable();
    display_data_mode();

    for (i = 0; i < ILI9341_HEIGHT; i+=ILI9341_LINES_PER_BUFFER){
        /*
         * Wait only for DMA done — NOT for SSIBusy.
         * The FIFO keeps clocking bits out in the background while we poll.
         * The next DMA burst starts feeding the FIFO as soon as it has room,
         * with zero dead time on the SPI bus.
         */
        while (MAP_uDMAChannelSizeGet(UDMA_CH15_SSI3TX | UDMA_PRI_SELECT));

