Arellano1904/Texas-Instruments-TivaC/TM4C123GH6PM_develop/drivers/2.4inchDisplay.c
void touch_disable(void){
    MAP_GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_0, GPIO_PIN_0);
}
// Clock one channel: a 16-bit command frame followed by a 16-bit frame that
// shifts out the BUSY bit + the 12 data bits. The command sits in the low byte
// so the leading zero byte acts as the start-bit gap; on the next frame the
// result lands left-aligned, so (rx >> 3) drops BUSY and the 3 trailing bits.
// Returns the averaged 0..4095 sample. CS is owned by the caller so several
// channels can share a single assertion.
static uint16_t touch_read_raw(uint8_t cmd){
    uint32_t rx;
    uint32_t acc = 0;
    uint8_t i;
    for(i = 0; i < XPT2046_SAMPLES; i++){
        MAP_SSIDataPut(SSI0_BASE, (uint16_t)cmd);   // send command
        MAP_SSIDataGet(SSI0_BASE, &rx);             // discard command echo
        MAP_SSIDataPut(SSI0_BASE, 0x0000);          // clock out the result
        MAP_SSIDataGet(SSI0_BASE, &rx);
        acc += (rx >> 3) & 0x0FFF;
    }
    return (uint16_t)(acc / XPT2046_SAMPLES);
}

// Linear map of a raw reading onto [0, out_max], clamped at the edges.
static uint16_t touch_scale(uint16_t raw, uint16_t in_min, uint16_t in_max, uint16_t out_max){
    if(raw <= in_min){ return 0; }
    if(raw >= in_max){ return out_max; }
    return (uint16_t)(((uint32_t)(raw - in_min) * out_max) / (in_max - in_min));
}

void touch_request_coords(void){
    uint32_t flush;
    uint16_t raw_x, raw_y;

    // Reading the controller makes PENIRQ pulse, which would otherwise queue a
    // spurious touch interrupt and keep touch_asserted stuck set. Mask PB2 for
    // the duration of the transfer.
    MAP_GPIOIntDisable(GPIO_PORTB_BASE, GPIO_PIN_2);

    touch_enable();                                         // CS low
    while(MAP_SSIDataGetNonBlocking(SSI0_BASE, &flush)){}   // drop stale RX data

    raw_x = touch_read_raw(XPT2046_CMD_X);
    raw_y = touch_read_raw(XPT2046_CMD_Y);

    while(MAP_SSIBusy(SSI0_BASE)){}                         // let the last frame finish
    touch_disable();                                        // CS high

    // Discard the glitch the read produced, then re-arm the touch interrupt.
    MAP_GPIOIntClear(GPIO_PORTB_BASE, GPIO_PIN_2);
    MAP_GPIOIntEnable(GPIO_PORTB_BASE, GPIO_PIN_2);

    // Portrait-flipped panel: both axes run opposite to the raw ADC sweep, so
    // invert each mapped result. Adjust the *_MIN/*_MAX limits during
    // calibration; swap the channel->axis assignment if the panel is mounted
    // rotated 90 degrees.
    touch_x = (XPT2046_SCREEN_W - 1) - touch_scale(raw_x, XPT2046_X_MIN, XPT2046_X_MAX, XPT2046_SCREEN_W - 1);
    touch_y = (XPT2046_SCREEN_H - 1) - touch_scale(raw_y, XPT2046_Y_MIN, XPT2046_Y_MAX, XPT2046_SCREEN_H - 1);
}

void touch_init(void){
    touch_spi_config();
}

void touch_int_handler(void){
    // Read interrupt status from port B.
    uint32_t int_status = MAP_GPIOIntStatus(GPIO_PORTB_BASE, true);
    // Clear interrupts immediately
    MAP_GPIOIntClear(GPIO_PORTB_BASE, int_status);
    // Set touch flag
    if(int_status & GPIO_PIN_2){// Touch pressed
        touch_asserted = 0x01;
        return;
    }
}

void touch_spi_config(void){
    // Enable SSI0 plus the GPIO ports the touch controller spans:
    //   Port A -> SSI0 data/clock lines, Port B -> CS / RESET / touch IRQ.
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_SSI0);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_SSI0));
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_GPIOA));
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_GPIOB));
    // SSI0 signals on Port A: {PA2:Clk, PA4:MISO(RX), PA5:MOSI(TX)}.
    // Moved off SSI2/PB4-7 because the LaunchPad bridges PB6<->PD0 and
    // PB7<->PD1 through R9/R10, which collide with the display's SSI3 CLK/CS.
    MAP_GPIOPinConfigure(GPIO_PA2_SSI0CLK);
    MAP_GPIOPinConfigure(GPIO_PA4_SSI0RX);
    MAP_GPIOPinConfigure(GPIO_PA5_SSI0TX);
    MAP_GPIOPinTypeSSI(GPIO_PORTA_BASE, GPIO_PIN_2 | GPIO_PIN_4 | GPIO_PIN_5);
    // Side-band pins stay on Port B: {PB0:CS, PB1:rst, PB2:int}.
    MAP_GPIOPinTypeGPIOOutput(GPIO_PORTB_BASE, GPIO_PIN_0 | GPIO_PIN_1);
    MAP_GPIOPinTypeGPIOInput(GPIO_PORTB_BASE, GPIO_PIN_2);
    // Park CS high so the XPT2046 deselects and releases DOUT (high-Z) until
    // a conversion is requested; otherwise it drives the shared MISO at boot.
    MAP_GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_0, GPIO_PIN_0);
    // Enable internal pull-ups for touch interrupt //
    MAP_GPIOPadConfigSet(GPIO_PORTB_BASE,GPIO_PIN_2,GPIO_STRENGTH_2MA,GPIO_PIN_TYPE_STD_WPU);
    // Disable interrupts during setup
    MAP_GPIOIntDisable(GPIO_PORTB_BASE, GPIO_PIN_2);
    MAP_GPIOIntClear(GPIO_PORTB_BASE, GPIO_PIN_2);
    // Configure interrupt type: falling edge
    MAP_GPIOIntTypeSet(GPIO_PORTB_BASE,GPIO_PIN_2,GPIO_FALLING_EDGE);
    // Enable GPIO interrupt (NVIC)
    MAP_IntEnable(INT_GPIOB);
    // Enable GPIO pin interrupts
    MAP_GPIOIntEnable(GPIO_PORTB_BASE, GPIO_PIN_2);
    // Config SSI0 module, master mode, 16bits len.
    MAP_SSIDisable(SSI0_BASE);
    SSIClockSourceSet(SSI0_BASE, SSI_CLOCK_SYSTEM);
    MAP_SSIConfigSetExpClk(SSI0_BASE, systemClkFreq, SSI_FRF_MOTO_MODE_0,SSI_MODE_MASTER,2000000, 16);
    MAP_SSIEnable(SSI0_BASE);
}
